app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at", "price", "author", "publishDate") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "harry potter"], ["created_at", "2022-09-16 00:18:19.699064"], ["updated_at", "2022-09-16 00:18:19.699064"], ["price", "19.0"], ["author", "ankith"], ["publishDate", "2023-01-01"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = $1, "updated_at" = $2, "author" = $3 WHERE "books"."id" = $4  [["title", "harry potter"], ["updated_at", "2022-09-16 00:42:10.184510"], ["author", "jk rowling"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 3]]
---
  def destroy
    @book.destroy